#+FILETAGS: UCSD

* Personal Website
** SOMEDAY Update website template
check out http://www.wix.com/
use org-mode to write content, css to render
  CLOCK: [2012-10-15 Mon 10:13]--[2012-10-15 Mon 10:13] =>  0:00
   :PROPERTIES:
   :ID:       95bed625-9178-4c2e-977b-ca4098a5ae3a
   :END:
[2012-10-15 Mon 10:13]

** SOMEDAY Write in org mode
   :PROPERTIES:
   :ID:       d4065564-7904-47cc-b82c-68a9e060597e
   :END:
** SOMEDAY Write website content
   :PROPERTIES:
   :ID:       5c8378f9-737c-4a4a-98ea-52d9c4ca3e93
   :END:
*** SOMEDAY CV
    :PROPERTIES:
    :ID:       27dfad08-3c5c-4678-a6d6-83cf0594c320
    :END:
*** SOMEDAY Links to papers
    :PROPERTIES:
    :ID:       001a6a07-ac07-41ab-918a-fea9bd071d53
    :END:
*** SOMEDAY Research interests
    :PROPERTIES:
    :ID:       3dd10810-b2c4-4677-b2c4-e4d542620645
    :END:
* Teaching
  :PROPERTIES:
  :CATEGORY: Teaching
  :END:

** SOMEDAY Write org-mode teaching paper
Use a course as a guinea pig for using the method
  CLOCK: [2012-10-14 Sun 20:43]--[2012-10-14 Sun 20:44] =>  0:01
    :PROPERTIES:
    :ID:       d58effe4-6b9d-48e3-96a1-a6a992538c6c
    :END:
[2012-10-14 Sun 20:43]

** TODO MATH150A Fall 2012
   :PROPERTIES:
   :CATEGORY: MATH150A FALL2012
   :ID:       7b8cd00b-6f86-4280-a4c6-8cbdd0dcfc87
   :END:

*** CANCELLED math150a lecture log				   :COMPUTER:
    - State "CANCELLED"  from "NEXT"       [2012-11-03 Sat 14:10] \\
      I'm not going to get around to doing this.
    :PROPERTIES:
    :ID:       9152bf49-2b50-4ac9-a640-5b193d4ced49
    :END:
*** CANCELLED math150a notes					   :COMPUTER:
    - State "CANCELLED"  from "NEXT"       [2012-11-03 Sat 14:11] \\
      I'm not going to get around to doing this.
    :PROPERTIES:
    :ID:       f93a4094-41d2-4732-96fa-1be37fd96312
    :END:
    circle arc-len parametrisations
    curve len independent of parametrisation
    links to Hans Lindblan inverse function theorem notes?

*** DONE Assign math150a homework 3				   :COMPUTER:
    - State "DONE"       from "NEXT"       [2012-10-26 Fri 14:59]
    :PROPERTIES:
    :ID:       a53a8975-7eae-4ed4-b625-9b95c73d2272
    :END:
    
*** CANCELLED In lecture log, talk about area, Green's thm
    - State "CANCELLED"  from "TODO"       [2012-10-18 Thu 14:46] \\
      Not necessary
*** DONE MATH150 Wk 3 lectures
    - State "DONE"       from "TODO"       [2012-10-18 Thu 14:45]
  CLOCK: [2012-10-14 Sun 20:34]--[2012-10-14 Sun 20:34] =>  0:00
  [2012-10-14 Sun 20:34]
*** DONE Prepare MATH150A Week 4 Lectures 
    - State "DONE"       from "TODO"       [2012-10-29 Mon 10:25]
  CLOCK: [2012-10-15 Mon 15:22]--[2012-10-15 Mon 15:23] =>  0:01
    :PROPERTIES:
    :ID:       b212184e-2cc5-4357-a1ec-7254f24a53b4
    :END:
  [2012-10-15 Mon 15:22]
**** DONE Lec 1
     - State "DONE"       from "NEXT"       [2012-10-26 Fri 14:59]
     :PROPERTIES:
     :ID:       a5e99085-03d1-4a2a-b802-ec5d366f284c
     :END:
Recap on level sets are regular
Sec 2-3
**** DONE Lec 2
     - State "DONE"       from "NEXT"       [2012-10-26 Fri 14:59]
     :PROPERTIES:
     :ID:       09d8e4f0-66f7-4bc7-a4fe-a26e965defb6
     :END:
Inverse function theorem: examples, non-examples and implicit function theorem
**** DONE Lec 3
     - State "DONE"       from "NEXT"       [2012-10-26 Fri 14:59]
     :PROPERTIES:
     :ID:       a1034819-8d45-4b63-9b60-2a72458a7d0e
     :END:
Maybe do the [[http://www.math.ucsd.edu/~lindblad/150a/l10.pdf][Hans Lindblad contraction mapping]] stuff?

*** DONE Set MATH150a mid term
    DEADLINE: <2012-11-05 Mon -3d>
    - State "DONE"       from "WAITING"    [2012-11-04 Sun 15:36]
    - State "WAITING"    from "NEXT"       [2012-11-03 Sat 14:04] \\
      Waiting for feedback from Bo Yang on midterm.
  CLOCK: [2012-10-15 Mon 10:13]--[2012-10-15 Mon 10:13] =>  0:00
    :PROPERTIES:
    :ID:       b3245c16-be40-47e8-8405-64bbfa9a6717
    :END:
[2012-10-15 Mon 10:13]
**** DONE Check math1501a Practice exams
     - State "DONE"       from "NEXT"       [2012-11-03 Sat 14:10]
     :PROPERTIES:
     :ID:       4eca34a2-952a-4fad-adbf-b0642cee0ffd
     :END: 
Some are here [[http://www.math.ucsd.edu/~lindblad/150a/150a.html]]
**** CANCELLED Get samples from Ben
     - State "CANCELLED"  from "WAITING"    [2012-11-04 Sun 15:35] \\
       Wrote the mid term without needing Ben's examples.
     - State "WAITING"    from "NEXT"       [2012-10-19 Fri 14:03] \\
       Ben is looking for past exams
     :PROPERTIES:
     :ID:       b38fd5c9-c7dc-4951-8b1f-6b0e0c7d95cb
     :END:

**** DONE Devise math150a midterm problems and write them up
     - State "DONE"       from "NEXT"       [2012-11-03 Sat 14:10]
     :PROPERTIES:
     :ID:       06fb3571-c9b6-4668-8b8f-02c1fb22cd1e
     :END:
**** DONE Check with Holly about proctoring, blue books, general process
     - State "DONE"       from "NEXT"       [2012-11-03 Sat 14:10]
     :PROPERTIES:
     :ID:       cd29cbca-0097-4424-8256-96a613819fa3
     :END:

*** DONE Get homework scores
    - State "DONE"       from "TODO"       [2012-10-18 Thu 14:44]
[[https://docs.google.com/a/ucsd.edu/spreadsheet/ccc?key=0AlsrGAe5FGyBdGR3T29ERERzMm44LTRoU3R2bU13RkE&invite=CNuWms4G][Fall Math 150A]]
  CLOCK: [2012-10-18 Thu 10:44]--[2012-10-18 Thu 10:44] =>  0:00
[2012-10-18 Thu 10:44]

*** TODO Meet Bo Yang
    SCHEDULED: <2012-11-16 Fri 10:00 +1w>
    - State "DONE"       from "TODO"       [2012-11-09 Fri 10:23]
    - State "DONE"       from "TODO"       [2012-11-02 Fri 10:37]
    - State "DONE"       from "TODO"       [2012-10-26 Fri 13:08]
    - State "DONE"       from "TODO"       [2012-10-23 Tue 11:24]
    :PROPERTIES:
    :ID:       c8e2450b-bf17-4295-acdf-371ed5abd3d1
    :LAST_REPEAT: [2012-11-09 Fri 10:23]
    :END:
*** TODO Write final exam
*** NEXT Prepare week 6 lectures


*** TODO Remind students to fill in CAPE forms
<2012-12-03 Mon>
<2012-12-05 Wed>
<2012-12-07 Fri>
  CLOCK: [2012-11-12 Mon 12:20]
[2012-11-12 Mon 12:20]

** DONE Setup reminder for MATH142B
   - State "DONE"       from "TODO"       [2012-10-29 Mon 10:27]
  CLOCK: [2012-10-15 Mon 10:27]--[2012-10-15 Mon 10:28] =>  0:01
   :PROPERTIES:
   :ID:       351dabb7-be5d-458a-8f6b-0959ee00991d
   :END:
[2012-10-15 Mon 10:27]

** DONE Winter text books					   :COMPUTER:
   - State "DONE"       from "TODO"       [2012-11-02 Fri 15:53]
   :PROPERTIES:
   :ID:       ca36acea-9953-4821-88a1-69ed34f77979
   :END:
** TODO MATH142B
*** NEXT Plan MATH142B course
    SCHEDULED: <2012-12-10 Mon>

** TODO Summer 2013
*** DONE Sign up for summer 2013 teaching
    - State "DONE"       from "TODO"       [2012-11-09 Fri 11:57]

  CLOCK: [2012-11-02 Fri 15:50]--[2012-11-02 Fri 15:52] =>  0:02
[2012-11-02 Fri 15:50]

[[file:~/teaching/summer_2013/SS%202013%20Request-Proposal.doc][file:~/teaching/summer_2013/SS 2013 Request-Proposal.doc]]
[[file:~/teaching/summer_2013/Summer_Session_Enrollment.pdf]]

**** NEXT Contact Holly, Scott etc. about summer 2013 teaching
**** TODO Choose subjects and submit form
*** WAITING Plan courses
    - State "WAITING"    from ""           [2012-11-09 Fri 11:58] \\
      Waiting on course assignments
* Seminars
** DONE Plan DG Seminar
   - State "DONE"       from "TODO"       [2012-10-29 Mon 10:23]
   :PROPERTIES:
   :ID:       4971ad3c-684f-45df-9002-ce8bead60ce7
   :END:
*** DONE Prepare talk for next week
    - State "DONE"       from "NEXT"       [2012-10-24 Wed 13:15]
  CLOCK: [2012-10-16 Tue 08:28]--[2012-10-16 Tue 08:28] =>  0:00
    :PROPERTIES:
    :ID:       b7a65ab1-a46a-43db-8c55-6cd686ce7551
    :END:
[2012-10-16 Tue 08:28]

*** DONE Make seminar website
    :PROPERTIES:
    :ID:       bbb38675-1efc-4046-8606-3c0f2524dc72
    :END:
    - State "DONE"       from "NEXT"       [2012-10-19 Fri 15:24]

*** DONE Advertise seminar
    - State "DONE"       from "NEXT"       [2012-10-26 Fri 15:01]
    :PROPERTIES:
    :ID:       4840471b-e6b2-4079-b67c-7b261adf77d6
    :END:
    email math-grad, general math list?
*** DONE Email Ben, Lei and Jim about possible speakers.
    - State "DONE"       from "NEXT"       [2012-10-26 Fri 15:01]
    :PROPERTIES:
    :ID:       80623a86-568e-416a-85de-895be875f516
    :END:

** TODO UCSD DG Seminar
*** DONE 20121025 Talk
   - State "DONE"       from "TODO"       [2012-10-31 Wed 10:47]
  CLOCK: [2012-10-17 Wed 10:31]--[2012-10-17 Wed 10:31] =>  0:00
   :PROPERTIES:
   :ID:       d31f792f-5123-452d-bca5-f4551f372e00
   :END:
[2012-10-17 Wed 10:31]
[[file:~/working/talks/20121025_ucsd_dg_seminar]]
*** NEXT Ask Ben about Inviting ZhiQin Lu to speak at DG conference
[[zlu@math.uci.edu][zlu@math.uci.edu]]
  CLOCK: [2012-10-25 Thu 11:31]--[2012-10-25 Thu 11:32] =>  0:01
[2012-10-25 Thu 11:31]

*** DONE Set up reminder for seminar announcement
    - State "DONE"       from "NEXT"       [2012-11-03 Sat 18:51]
  CLOCK: [2012-10-26 Fri 15:07]--[2012-10-26 Fri 15:08] =>  0:01
[2012-10-26 Fri 15:07]
*** DG Seminar
    <2012-11-08 Thu 10:00-11:00 +1w>
*** TODO Send DG seminar email announcement 
<2012-11-15 Thu +1w>
**** Email
 [[mailto:seminarstaff@math.ucsd.edu]]
**** Template
Speaker: <SPEAKER>
Home Institution: <INSTITUTION>
Facult Host: [HOST]
Date: <DATE>
Seminar Name: Differential Geometry
Title: <TITLE>
Start Time: 10 am
Location: AP&M 7218

Abstract:

<ABSTRACT>

* Tasks
** CANCELLED Update office hours
   - State "CANCELLED"  from "TODO"       [2012-11-12 Mon 11:58] \\
     Bit late in the quarter to worry about now
  CLOCK: [2012-10-18 Thu 10:45]--[2012-10-18 Thu 10:45] =>  0:00
   :PROPERTIES:
   :ID:       ca310cc2-09d1-4d8f-bc15-f702e5b5cb04
   :END:
[2012-10-18 Thu 10:45]
To all Instructional Faculty and TAs for Fall 2012 (please note the correctly working links to office hour information);

It's that time of the quarter when we ask you to submit office hours to the front desk.  We are continuing with our on-line submission form that interacts with the departmental webpages, listing office hours at either
http://math.ucsd.edu/people/office-hours-instructors/
for Faculty
or
http://math.ucsd.edu/people/office-hours-tas/
for TAs


To submit your office hours:

  1. Go to web site: http://mathlink.ucsd.edu/

  2. Enter YOUR Euclid username and password and click on the login button

  3. Click the Office Hours icon

  4. A list with all your Fall 2012 courses will be presented

  5. Select one of the courses by pressing 'Edit'

  6. Fill out the days and hours for your primary office hours and any additional office hours you will be holding for each course.

  7. Logout when finished

If you have difficulties with the system, please feel free to email me your hours - along with any suggestions for improving the submission system.

Thank you,
Scott

-------------------------
Scott Rollans
Undergraduate Program Officer
UCSD Mathematics
** TODO Do ethics training
  DEADLINE: <2012-12-31 Mon -1m>
[[http://uclearning.ucsd.edu/][http://uclearning.ucsd.edu/]]
Search for UCGCB-2012

  CLOCK: [2012-11-02 Fri 10:36]--[2012-11-02 Fri 10:37] =>  0:01
[2012-11-02 Fri 10:36]
** TODO Sexual harrassment course
   DEADLINE: <2012-12-12 Wed -1w>

  CLOCK: [2012-11-12 Mon 11:56]--[2012-11-12 Mon 11:57] =>  0:01
[2012-11-12 Mon 11:56]
[[http://uc.sumtotalsystems.com/sumtotal/a.aspx?p=1561376*95486]]

* Notes
* Calendar
** Math pizza 
   <2012-10-26 Fri 15:30-17:30>
Round Table pizza

* Computing Environment
** SOMEDAY Make super computer project
   :PROPERTIES:
   :ID:       c8a44475-f8cb-4df8-be68-1a4d49e529c0
   :END:
See [[file:~/Documents/TSCC/TSCC-Description-For-Participants.doc][TSCC-Description-For-Participants.doc]] and [[file:~/Documents/TSCC/TSCC_UserGroup_20121017.ppt][TSCC_UserGroup_20121017.ppt]]
